Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.AddNonContinuousRail(System.String,System.Double,System.Double)
Creates and appends a new Non-Continuous Rail to the Rail Structure.
The new Non-Continuous Rail will have the given name, height and offset.
It will have default profile and material ElementIds.
name:
The name of the non-continuous rail.
height:
The height on which the non-continuous rail will be placed.
offset:
The offset of the non-continuous rail from a Autodesk::Revit::DB::Architecture::Railing center.
Returns:
Handle to the new Non-Continuous Rail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The name is a duplicate of an existing non-continuous rail.
-or-
The height height is not valid for the non-continuous rail because
it is greater than the height of the RailingType to which it belongs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be no more than 30000 feet in absolute value.
-or-
The given value for offset must be no more than 30000 feet in absolute value.
Since:
2019