
Autodesk.Revit.DB.Analysis.CriticalPathIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.Analysis.CriticalPathIterator.GetCurrent
Gets the analytical segment id at the current iterating position.
Returns:
The segment id of the current iterating position.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathIterator.Reset
Resets the iterator to the beginning segment.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathIterator.MoveNext
Increments the iterator to the next downstream segment on the critical path.
Returns:
True if there is another segment available on the critical path that is not visited by this iterator,
False if there is no next segment left.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if all segments have been visited on the critical path.
False if there are more segments to be visited.
Since:
2025

Autodesk.Revit.DB.Analysis.CriticalPathIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.CriticalPathIterator
An iterator to traverse the critical path in the CriticalPathCollector.
Since:
2025