Autodesk.Revit.DB.Electrical.Conduit.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a new instance of conduit.
Remarks:
This method will regenerate the document.
document:
The document.
conduitType:
The conduit type.  This must be a conduit type accepted by isValidConduitType().
If the input conduit type is InvalidElementId, the default conduit type from the document will be used.
startPoint:
The start point of the conduit location line.
endPoint:
The end point of the conduit location line.
levelId:
The element id of the level which this conduit based.
If the input level id is invalidElementId = -1, the nearest level will be used.
Returns:
The newly created conduit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This conduit type is invalid.
-or-
This level id is invalid.
-or-
The points of startPoint and endPoint are too close: for MEPCurve, the minimum length is 1/10 inch.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.